#pragma once
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#include <Arduino.h>
#include "FileUtils.h"
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#define COMMA_DELIMITER "," // разделитель полей в CSV
#define NEWLINE F("\r\n") // новая строка
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
class LoggerClass
{
  public:

    LoggerClass();

    void write(uint8_t* data,size_t dataLength);    
    String formatCSV(const String& input);

    void newLogFile(); // создаёт новый файл за сегодня, прибавляя нумерацию

    void begin();

  private:

    SdFile workFile;
    bool openWorkFile();
    void closeWorkFile();

    String _COMMA, _NEWLINE;

    uint8_t lastDayOfMonth;
    uint8_t todayLogFileNumber;

};
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
extern LoggerClass Logger;
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
